lefty01/ESP32_TTGO_FTMS/src/Hardware.cpp
void btn3TapHandler(Button2 & b)
{
  unsigned int time = b.wasPressedFor();
  DEBUG_PRINTLN("Button 3 TapHandler");
  if (time > 3000) {
    // DEBUG_PRINTLN("very long (>3s) click ... do nothing");
  }
  else 
  {
    DEBUG_PRINTLN("short click...");
    if ((speedInclineMode & SPEED) == 0)
    {
      speedDown();
    }  
    if ((speedInclineMode & INCLINE) == 0)
    {
      inclineDown();
    }  
  }
}

void loopHandleButton()
{
#ifdef BUTTON_1
  btn1.loop();
#endif
#ifdef BUTTON_2
  btn2.loop();
#endif
#ifdef BUTTON_3
    btn3.loop();
#endif
}

void initButton()
{
  logText("initButton...");  
#ifdef BUTTON_1
  // button 1 (GPIO 0) control auto/manual mode and reset timers
  btn1.setTapHandler(btn1TapHandler);
#endif

  // if only two buttons, then button 1 switches mode and button 2 short is up, button 2 long is down
  // if three buttons use button 2 short as up and button 3 short as down
  // fixme: keep button2 long handler for now does not hurt
  // initially for testing purpose ... but if we can access the controller while running it can serve as backup
  // if sensors fail or suddnely send incorrect readings (yeah that happend to me) ... but since the controller
  // might not be accessable we have the web interface that can run on the smartphone
#ifdef BUTTON_2
  // short  click = up
  // longer click = down
  btn2.setTapHandler(btn2TapHandler);
 #endif

#ifdef BUTTON_3
  // short  click = down
  btn3.setTapHandler(btn3TapHandler);
#endif
  logText("done\n");  
}

void delayWithDisplayUpdate(unsigned long delayMilli)
{
  unsigned long timeStartMilli = millis();
  unsigned long currentMilli = timeStartMilli;
  while((currentMilli - timeStartMilli) < delayMilli)
  {
#warning todo cs: add gxloop handler again.
//    gfxUpdateLoopHandler();
    unsigned long timeLeftMilli = delayMilli - (currentMilli - timeStartMilli) ; 
    if (timeLeftMilli >= 5 )
    {
      delay(5);
    }
    else
    {
      delay(timeLeftMilli);
    }
    currentMilli = millis();
  }
}

void initSensors(void)
{
  if (configTreadmill.hasMPU6050)
  {
    // Mesure incline using angle "detector" MPU6050
    logText("init MPU6050....");

    I2C_0.begin(SDA_0, SCL_0, I2C_FREQ);
    byte status = mpu6050.begin();
    DEBUG_PRINT("status: ");
    DEBUG_PRINT(status);

    if (status != 0) 
    {
      logText(" failed (DISABLED)\n");
      configTreadmill.hasMPU6050 = false;
      // TODO Would we want to retry, now, later, by config or is power off/on good enough
    }
    else
    {
      logText("Calc offsets, do not move MPU6050 (3sec)");

      mpu6050.calcOffsets(); // gyro and accel.
      delayWithDisplayUpdate(2000);
      speedInclineMode |= INCLINE;

      logText(" done\n");
    }
    I2C_0.end();
  }
}
// ------------------ Mesure speed with something triggering a GPIO pin periodicle
// Triggered periodiacly according to speed, could be a HAL sensor on the front roller of the treadmill
// Might be a signal found in your treadmill cable harnest
void IRAM_ATTR reedSwitch_ISR()
{
  // calculate the microseconds since the last interrupt.
  // Interupt activates on falling edge.
  uint32_t usNow = micros();
  uint32_t test_elapsed = usNow - startTime;

  // handle button bounce (ignore if less than 300 microseconds since last interupt)
  if (test_elapsed < 300) {
    return;
  }

  //if (test_elapsed > 1000000) {
  if (test_elapsed > 1000000) {  // assume the treadmill isn't spinning in 1 second.
    startTime = usNow; // reset the clock;
    longpauseTime = 0;
    return;
  }
  if (test_elapsed > longpauseTime / 2) {
    // acts as a debounce, don't looking for interupts soon after the first hit.
    //DEBUG_PRINT(test_elapsed); //DEBUG_PRINTLN(" Counted");

    startTime = usNow;  // reset the clock
    //long elapsed = test_elapsed;
    longpauseTime = test_elapsed;

    revCount++;
    workoutDistance += configTreadmill.belt_distance;
    accumulatorInterval += test_elapsed;
  }
}

// ------------------ Mesure speed with something 2 triggers on GPIO pin periodicle like a marker on the loop?
// Messure two IR-Sensors
static void IRAM_ATTR speedSensor1_ISR(void)
{
  if (! t1_valid) {
    t1 = micros();
    t1_valid = true;
  }
}

static void IRAM_ATTR speedSensor2_ISR(void)
{
  if (t1_valid && !t2_valid) {
    t2 = micros();
    t2_valid = true;
  }
}

// getIncline()
// This will read the used "incline" sensor, run this periodically
// The following global variables will be updated
//    angle - the angle of the running are
//    incline - the incline value (% of angle between 0 and 45 degree)
//              incline is usally the value shown by your treadmill.
float getIncline(void) 
{
  double sensorAngle = 0.0;
  float temp_incline = 0.0;
  char yStr[5];
  char inclineStr[6];

  if (configTreadmill.hasMPU6050) 
  {
    // MPU6050 returns a incline/grade in degrees(!)
    // TODO: configure sensor orientation  via webinterface
    // FIXME: maybe get some rolling-average of Y-angle to smooth things a bit (same for speed)
    // mpu.getAngle[XYZ]
    sensorAngle = mpu6050.getAngleY(); //This does not use I2C no need to I2C begin/end

    angle = angleSensorTreadmillConversion(sensorAngle); // convert angle depending on treadmill placment of mpu6050

    if (angle < 0) angle = 0;  // TODO We might allow running downhill

    snprintf(yStr, 5, "%.2f", angle);

    temp_incline = tan(angle * DEG_TO_RAD) * 100;
    snprintf(inclineStr, 6, "%.1f", temp_incline);

    //client.publish(getTopic(MQTT_TOPIC_Y_ANGLE), yStr);
#warning check out if this must be here ******************
    // CS WHY IS THIS HERE
    //client.publish(getTopic(MQTT_TOPIC_INCLINE), inclineStr);
    // ******************************************
  }

  if (temp_incline <= configTreadmill.min_incline) temp_incline = configTreadmill.min_incline;
  if (temp_incline > configTreadmill.max_incline)  temp_incline = configTreadmill.max_incline;

#warning cs todo remove this
  DEBUG_PRINTF("sensor angle (%.2f): used angle: %.2f: -> incline: %f%%\n",sensorAngle, angle, temp_incline);

