lefty01/ESP32_TTGO_FTMS/src/Hardware.cpp
  // TODO probably need some more smoothing here ...
  return temp_incline;
}

void loopHandleHardware(void)
{
  // NOTE/WARNING:
  // MPU6050 (mpu) and GPIOExtender use twowire i2c driver and LovyanGFX has it's own
  // This makes the twowire collide in some way and you get a 1s delay after each touch
  // on the screen. To solve this collition of the i2c HW LovyanGFX code shoule be placed
  // outside of the I2C_0.begin/end below that surrounds MPU6050 (mpu), GPIOExtender class
  // is part of our code hand has it's own I2C_0.begin() and I2C_0.end() when using I2C

  GPIOExtender.scanButtons();

  if ((millis() - sw_timer_clock) > EVERY_SECOND) 
  {
    sw_timer_clock = millis();
    timer_tick = true;
  } 

  if (configTreadmill.hasMPU6050)
  {
    I2C_0.begin(SDA_0 , SCL_0 , I2C_FREQ); 
    mpu6050.update();  // read out data from the sensor
    I2C_0.end();
  }  

  // IrSensor to check speed
  if (configTreadmill.hasIrSense)
  {
    unsigned long t;
#warning remove this constant to some config/file  
    const unsigned long c = 359712; // d=10cm
    t = t2 - t1;
    // check ir-speed sensor if not manual mode
    if (t2_valid) 
    { // hasIrSense = detected
      kmphIRsense = (float)(1.0 / t) * c;
      noInterrupts();
      t1_valid = t2_valid = false;
      interrupts();
      DEBUG_PRINTF("IrSense: t=%li kmph_sense=%f\n",t,kmphIRsense);
    }

  }
} 

// A simple event handler, currenly just a call stack, an event queue would be smarter
// but this solves the problem as a start, not sure it we really have the usecase where
// we need a queue, lets add it in that case

void handleEvent(EventType event)
{
  // Add more event handlers here in prio order, checking if handled before running
  // each handle will return true is event is handled so we can stop the event check
  // in that case.
  // Currently there is no queue so if Events are translated to new events and call
  // handleEvent() to post them take care to not get into loops.
  if (GPIOExtender.pressEvent(event)) return;

  DEBUG_PRINTF("handleEvent() Cant handle Event:0x%x\n",static_cast<uint32_t>(event));
  return;
}
float calculateRPM(void)
{
  float temp_rpm = 0;

  if (configTreadmill.hasReed)
  {
    if (revCount > 0) 
    { // confirm there was at least one spin in the last second
      noInterrupts();
      temp_rpm = 60000000 / (accumulatorInterval / revCount);
      revCount = 0;
      accumulatorInterval = 0;
      interrupts();
    } 
  }
  else 
  {
    temp_rpm = 0;
    //rpmaccumulatorInterval = 0;
    //accumulator4 = 0;  // average rpm of last 4 samples
  }
  return temp_rpm;
}

static void initGPIOExtender(void) {
  logText("initGPIOExtender...\n");  
  while (!GPIOExtender.begin())
  {
    DEBUG_PRINTLN("GPIOExtender not found");
    return;
  }

#ifdef AW9523_IRQ_MODE
  pinMode(AW9523_INTERRUPT_PIN, INPUT_PULLUP); 
  //pinMode(AW9523_INTERRUPT_PIN, INPUT);
  attachInterrupt(digitalPinToInterrupt(AW9523_INTERRUPT_PIN), GPIOExtenderInterrupt, CHANGE);
  GPIOExtender.getPins(); // Get pins one to clear intrrupts
#endif
   logText("done\n");  
}

#ifdef AW9523_IRQ_MODE
static void IRAM_ATTR GPIOExtenderInterrupt(void) {
  GPIOExtender.gotInterrupt();
}
#endif

void GPIOExtenderAW9523::scanButtons(void)
{
    if (enabled)
    {
#ifdef AW9523_IRQ_MODE
        if (GPIOExtender.checkInterrupt())
#endif
        {
            static uint16_t prevKeys = 0;
            uint16_t pins = getPins();
            uint16_t keys = ((~pins) & 0x3f );

            if ( keys != prevKeys)
            {
            // New key status
            //DEBUG_PRINTF("GPIOExtender KEY IN:0x%x (0x%x)\n",keys,pins);

            if((keys & AW9523_KEY_UP) && AW9523_KEY_UP)
            {
                DEBUG_PRINTLN("AW9523_KEY_UP");
                handleEvent(EventType::KEY_UP);
                //handleEvent(EventType::TREADMILL_INC_UP);
            }
            if((keys & AW9523_KEY_LEFT) && AW9523_KEY_LEFT)
            {
                DEBUG_PRINTLN("AW9523_KEY_LEFT");
                handleEvent(EventType::KEY_LEFT);
                //handleEvent(EventType::TREADMILL_SPEED_DOWN);
            }
            if((keys & AW9523_KEY_DOWN) && AW9523_KEY_DOWN)
            {
                DEBUG_PRINTLN("AW9523_KEY_DOWN");
                handleEvent(EventType::KEY_DOWN);
                //handleEvent(EventType::TREADMILL_INC_DOWN);
            }
            if((keys & AW9523_KEY_RIGHT) && AW9523_KEY_RIGHT)
            {
                DEBUG_PRINTLN("AW9523_KEY_RIGHT");
                handleEvent(EventType::KEY_RIGHT);
                //handleEvent(EventType::TREADMILL_SPEED_UP);
            }
            if((keys & AW9523_KEY_OK) && AW9523_KEY_OK)
            {
                DEBUG_PRINTLN("AW9523_KEY_OK");
                handleEvent(EventType::KEY_OK);
                //handleEvent(EventType::TREADMILL_START);
            }
            if((keys & AW9523_KEY_BACK) && AW9523_KEY_BACK)
            {
                DEBUG_PRINTLN("AW9523_KEY_BACK");
                handleEvent(EventType::KEY_BACK);
                //handleEvent(EventType::TREADMILL_STOP);
            }

            if((keys & 0xffc0)  != 0)  DEBUG_PRINTF("Non key pins: 0x%x\n",keys);
            prevKeys = keys;
            }
        }
    }
}

void GPIOExtenderAW9523::logPins(void)
{
    if (enabled) {
        uint8_t port0 = read(INPUT_PORT0);
        uint8_t port1 = read(INPUT_PORT1);
        DEBUG_PRINTF("GPIOExtenderAW9523 Read port:0x%x%x\n",port1,port0);
    }
}

// Currently only support one button at time
bool GPIOExtenderAW9523::pressEvent(EventType eventButton)
{
    DEBUG_PRINTF("GPIOExtenderAW9523: pressEvent(0x%x)\n",static_cast<uint32_t>(eventButton));
    if (enabled)
    {
        // convert event to HW line
        uint16_t line=-1;
        switch(eventButton)
        {
            case EventType::TREADMILL_START:      line = AW9523_TREADMILL_START; break;
            case EventType::TREADMILL_SPEED_DOWN: line = AW9523_TREADMILL_SPEED_DOWN; break;
            case EventType::TREADMILL_INC_DOWN:   line = AW9523_TREADMILL_INC_DOWN; break;
            case EventType::TREADMILL_STOP:       line = AW9523_TREADMILL_STOP; break;
            case EventType::TREADMILL_SPEED_UP:   line = AW9523_TREADMILL_SPEED_UP; break;
            case EventType::TREADMILL_INC_UP:     line = AW9523_TREADMILL_INC_UP; break;
            default:
                // Cant handle Event
                DEBUG_PRINTF("GPIOExtenderAW9523 ERROR: Unknown event 0x%x\n",static_cast<uint32_t>(eventButton));
                return false;
        }
        if (line ==-1)
        {
            DEBUG_PRINTF("GPIOExtenderAW9523 ERROR: event not converted to line 0x%x\n",static_cast<uint32_t>(eventButton));
            return false;
        }
        DEBUG_PRINTF("GPIOExtenderAW9523: pressEvent(0x%x) -> 0x%x \n",static_cast<uint32_t>(eventButton),line);

        if (line & 0xff)
        {
            uint8_t port0Bit = line & 0xff;
            DEBUG_PRINTF("GPIOExtenderAW9523: pressEvent(0x%x) -> 0x%x port0=0x%x ~x%x\n",static_cast<uint32_t>(eventButton),line,port0Bit,~port0Bit);

            // pinMode(pin, OUTPUT);
            if (!write(CONFIG_PORT0,~port0Bit)) return false; //0-output 1-input
            // digitalWrite(pin, LOW);
            if (!write(OUTPUT_PORT0,~port0Bit)) return false; //0-low 1-high

#warning Remove delay and schedule last part later in some way and go back to "main" loop mode. 
            delay(TREADMILL_BUTTON_PRESS_SIGNAL_TIME_MS);

            // digitalWrite(pin, HIGH);
            if (!write(OUTPUT_PORT0,0xff)) return false; //0-low 1-high
            // pinMode(pin, INPUT);
            if (!write(CONFIG_PORT0,0xff)) return false; //0-output 1-input
        }
        else
        {
            uint8_t port1Bit = (line & 0xff00) >> 8;
            DEBUG_PRINTF("GPIOExtenderAW9523: pressEvent(0x%x) -> 0x%x port1=0x%x ~x%x\n",static_cast<uint32_t>(eventButton),line,port1Bit,~port1Bit);
            // pinMode(pin, OUTPUT);
            if (!write(CONFIG_PORT1,~port1Bit)) return false; //0-output 1-input
            // digitalWrite(pin, LOW);
            if (!write(OUTPUT_PORT1,~port1Bit)) return false; //0-low 1-high

#warning Remove delay and schedule last part later in some way and go back to "main" loop mode. 
            delay(TREADMILL_BUTTON_PRESS_SIGNAL_TIME_MS);

            // digitalWrite(pin, HIGH);
            if (!write(OUTPUT_PORT1,0xff)) return false; //0-low 1-high
            // pinMode(pin, INPUT);
            if (!write(CONFIG_PORT1,0xff)) return false; //0-output 1-input
        }
        return true;
    }
    return false;
}

