lefty01/ESP32_TTGO_FTMS/src/Hardware.cpp
uint8_t GPIOExtenderAW9523::read(uint8_t reg, bool i2cHandled)
{
  if(!i2cHandled)
  {
    // Warning/Info to avoid TwoWire and LovyanGFX I2C collition make sure to fullt init/deinit I2C driver states
    // around the I2C calls
    I2C_0.begin(SDA_0, SCL_0, I2C_FREQ);
  }
  wire->beginTransmission(AW9523_ADDR);
  wire->write(reg);
  wire->endTransmission(true);
  wire->requestFrom(AW9523_ADDR, static_cast<uint8_t>(1));
  uint8_t ret = wire->read();
  if(!i2cHandled)
  {
    I2C_0.end();    
  }
  return ret;

}

uint8_t GPIOExtenderAW9523::read(uint8_t reg)
{
    return read(reg,false);
}

bool GPIOExtenderAW9523::write(uint8_t reg, uint8_t data)
{
    // Warning/Info to avoid TwoWire and LovyanGFX I2C collition make sure to fullt init/deinit I2C driver states
    // around the I2C calls
    I2C_0.begin(SDA_0, SCL_0, I2C_FREQ);
    wire->beginTransmission(AW9523_ADDR);
    wire->write(reg);
    wire->write(data);
    uint8_t ret = wire->endTransmission();  // 0 if OK
    I2C_0.end();
    if (ret != 0)
    {
        DEBUG_PRINTF("GPIOExtenderAW9523 ERROR: write reg: 0x%x value:0x%x -> Error: 0x%x\n",reg, data, ret);
        return false;
    }
    return true;
}

bool GPIOExtenderAW9523::begin()
{
    enabled = false;
    isInterrupted = false;
    uint8_t id = read(ID);
    DEBUG_PRINTF("GPIOExtenderAW9523: Read ID: 0x%x = 0x%x\n",ID,id);

    if (id != ID_AW9523)
    {
      return false;
    }

    if (!write(OUTPUT_PORT0,0xff)) return false; //0-low 1-high
    if (!write(OUTPUT_PORT1,0xff)) return false; //0-low 1-high

    // All input
    if (!write(CONFIG_PORT0,0xff)) return false; //0-output 1-input
    if (!write(CONFIG_PORT1,0xff)) return false; //0-output 1-input

    if (!write(CTL,0x08)) return false; //0000x000  0-Open Drain 1-Push-Pull

#ifdef AW9523_IRQ_MODE
    if (!write(INT_PORT0,0x00)) return false; //0-enable 1-disable
    if (!write(INT_PORT1,0x00)) return false; //0-enable 1-disable
#else
    if (!write(INT_PORT0,0xff)) return false; //0-enable 1-disable
    if (!write(INT_PORT1,0xff)) return false; //0-enable 1-disable
#endif
    if (!write(LED_MODE_SWITCH0,0xff)) return false; //0-LED mode 1-GPIO mode
    if (!write(LED_MODE_SWITCH1,0xff)) return false; //0-LED mode 1-GPIO mode
    enabled = true;
    getPins();
    return true;
}

bool GPIOExtenderAW9523::isAvailable()
{
    return enabled;
}

uint16_t GPIOExtenderAW9523::getPins(void)
{
  if (enabled)
  {
    isInterrupted = false;
    // As this is part of main loop lets read both ports with one I2C begin/end
    // to speed thing up.
    I2C_0.begin(SDA_0, SCL_0, I2C_FREQ);

    uint8_t port0 = read(INPUT_PORT0,true);
    uint8_t port1 = read(INPUT_PORT1,true);

#ifdef AW9523_IRQ_MODE
    uint8_t int0 = read(INT_PORT0,true);
    uint8_t int1 = read(INT_PORT0,true);
    DEBUG_PRINTF("GPIOExtenderAW9523 Read port:0x%x%x  interrupt:0x%x%x \n",port1,port0,int0,int1);
#endif
    I2C_0.end();
    return ((port1 << 8) | port0);
  }
  return 0;
}  

bool GPIOExtenderAW9523::checkInterrupt(void)
{
    return (enabled && isInterrupted);
}

#ifdef AW9523_IRQ_MODE
void IRAM_ATTR GPIOExtenderAW9523::gotInterrupt(void)
{
    DEBUG_PRINTLN("AW9523 Interrupt");

    if (enabled)
    {
      // let set this and poll this bit later to avoid I2C reads in the interrupt routine
      isInterrupted = true;
      // TODO Is it ok to read I2C here? If so we can rework this for simpler code
      //      to maybe avoid the poll in loop()
    }
}
#endif

void initHardware(void)
{
  logText("init Hardware...");  
  reset_reason = esp_reset_reason();
#if defined(SPEED_IR_SENSOR1) && defined(SPEED_IR_SENSOR2)
  // pinMode(SPEED_IR_SENSOR1, INPUT_PULLUP); //TODO used?
  // pinMode(SPEED_IR_SENSOR1, INPUT_PULLUP); //TODO used?
  attachInterrupt(SPEED_IR_SENSOR1, speedSensor1_ISR, FALLING); //TODO used?
  attachInterrupt(SPEED_IR_SENSOR2, speedSensor2_ISR, FALLING); //TODO used?
#endif

  // note: I have 10k pull-up on SPEED_REED_SWITCH_PIN
  pinMode(SPEED_REED_SWITCH_PIN, INPUT);
  attachInterrupt(digitalPinToInterrupt(SPEED_REED_SWITCH_PIN), reedSwitch_ISR, FALLING);

  initGPIOExtender();
  initSensors();
  logText("done\n");
}

const char* getRstReason(esp_reset_reason_t r) {
  switch(r) {
  case ESP_RST_UNKNOWN:    return "ESP_RST_UNKNOWN";   //!< Reset reason can not be determined
  case ESP_RST_POWERON:    return "ESP_RST_POWERON";   //!< Reset due to power-on event
  case ESP_RST_EXT:        return "ESP_RST_EXT";       //!< Reset by external pin (not applicable for ESP32)
  case ESP_RST_SW:         return "ESP_RST_SW";        //!< Software reset via esp_restart
  case ESP_RST_PANIC:      return "ESP_RST_PANIC";     //!< Software reset due to exception/panic
  case ESP_RST_INT_WDT:    return "ESP_RST_INT_WDT";   //!< Reset (software or hardware) due to interrupt watchdog
  case ESP_RST_TASK_WDT:   return "ESP_RST_TASK_WDT";  //!< Reset due to task watchdog
  case ESP_RST_WDT:        return "ESP_RST_WDT";       //!< Reset due to other watchdogs
  case ESP_RST_DEEPSLEEP:  return "ESP_RST_DEEPSLEEP"; //!< Reset after exiting deep sleep mode
  case ESP_RST_BROWNOUT:   return "ESP_RST_BROWNOUT";  //!< Brownout reset (software or hardware)
  case ESP_RST_SDIO:       return "ESP_RST_SDIO";      //!< Reset over SDIO
  }
  return "INVALID";
}
